// ひらがな→絵文字辞書
let dictionary = {
"あ":"🐜",
"い":"🦑",
"う":"🐮",
"え":"🦐",
"お":"🐺",

"か":"🦀",
"き":"🌳",
"く":"🐻",
"け":"🦘",
"こ":"🦊",

"さ":"🐟",
"し":"🦌",
"す":"🦢",
"せ":"🦗",
"そ":"🦁",

"た":"🐙",
"ち":"🐭",
"つ":"🦅",
"て":"✋",
"と":"🐯",

"な":"🥜",
"に":"🐔",
"ぬ":"🐌",
"ね":"🐱",
"の":"🧠",

"は":"🦷",
"ひ":"🐣",
"ふ":"🐡",
"へ":"🐍",
"ほ":"🦄",

"ま":"🐒",
"み":"👂",
"む":"🐛",
"め":"👀",
"も":"🍑",

"や":"🗻",
"ゆ":"🦢",
"よ":"🌙",

"ら":"🦙",
"り":"🐿️",
"る":"💎",
"れ":"🌈",
"ろ":"🤖",

"わ":"🦅",
"を":"⭕",
"ん":"🥖",

"が":"🦍",
"ぎ":"🎸",
"ぐ":"🍇",
"げ":"🦎",
"ご":"🦍",

"ざ":"🦓",
"じ":"🦌",
"ず":"⚡",
"ぜ":"💰",
"ぞ":"🐘",

"だ":"💧",
"ぢ":"🌍",
"づ":"🌊",
"で":"🚪",
"ど":"🐲",

"ば":"🍌",
"び":"🍺",
"ぶ":"🐷",
"べ":"🛏️",
"ぼ":"⚽",

"ぱ":"🥐",
"ぴ":"🫑",
"ぷ":"🍮",
"ぺ":"🖊️",
"ぽ":"🍿",

"ぁ":"🐜",
"ぃ":"🦑",
"ぅ":"🐮",
"ぇ":"🦐",
"ぉ":"🐺",

"ゃ":"🗻",
"ゅ":"🦢",
"ょ":"🌙",

"っ":"⭐",
"ー":"➖"
};

// 保存済み辞書を読み込む
const saved = localStorage.getItem("emojiDictionary");

if(saved){
    dictionary = JSON.parse(saved);
}

// カタカナ→ひらがな
function katakanaToHiragana(str){

return str.replace(/[ァ-ヶ]/g,function(s){
return String.fromCharCode(s.charCodeAt(0)-0x60);
});

}

// 変換
function convertText(){

let text=document.getElementById("inputText").value;

text=katakanaToHiragana(text);

let result="";

for(let ch of text){

if(dictionary[ch]){
result+=dictionary[ch];
}else{
result+=ch;
}

}

document.getElementById("output").innerText=result;

}

// コピー
function copyResult(){

let text=document.getElementById("output").innerText;

navigator.clipboard.writeText(text);

alert("コピーしました！");

}
